---
type: AccessDeniedException
namespace: Autodesk.Revit.Exceptions
version: 2024
members: 1
tags: [revit-api, class]
---

# AccessDeniedException

`Autodesk.Revit.Exceptions.AccessDeniedException` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetObjectData | — | `public override void GetObjectData ( SerializationInfo info , StreamingContext context )` |